# RbsElecWireHotAdjustment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecWireHotAdjustment Property
ParameterTypeId Class See Also
---
"Hot Conductors"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecWireHotAdjustment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecWireHotAdjustment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecWireHotAdjustment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace